soyeon24/ESP32_STEVAL_VL53L9/lib/vl53l9/vl53l9_reg.h
/**
 ******************************************************************************
 * @file    vl53l9_reg.h
 * @author  IMD Software Team
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#ifndef VL53L9_REG_H
#define VL53L9_REG_H

#ifdef __cplusplus
extern "C" {
#endif

// exported macros
#define REGISTER_SIZE (32U)
#define BIT(b)        (1U << (b))
#define GENMASK(h, l) ((uint32_t)((~0U << ((uint32_t)l)) & (~0U >> (REGISTER_SIZE - 1U - ((uint32_t)h)))))

#define VL53L9_REGBASE_REVISION_STATUS (0x0000U)
#define VL53L9_REGADDR_MODEL_ID        (VL53L9_REGBASE_REVISION_STATUS + 0x0000U)
#define VL53L9_REGADDR_ROM_REVISION    (VL53L9_REGBASE_REVISION_STATUS + 0x000aU)
#define VL53L9_REGADDR_PATCH_REVISION  (VL53L9_REGBASE_REVISION_STATUS + 0x000cU)

#define VL53L9_REGBASE_SENSOR_STATUS               (0x0028U)
#define VL53L9_REGADDR_FRAME_COUNTER               (VL53L9_REGBASE_SENSOR_STATUS + 0x0000U)
#define VL53L9_REGADDR_TEMPERATURE                 (VL53L9_REGBASE_SENSOR_STATUS + 0x0004U)
#define VL53L9_REGADDR_LDD_TEMPERATURE             (VL53L9_REGBASE_SENSOR_STATUS + 0x0006U)
#define VL53L9_REGADDR_ERROR_CODE                  (VL53L9_REGBASE_SENSOR_STATUS + 0x003cU)
#define VL53L9_REGADDR_ERROR_STATUS                (VL53L9_REGBASE_SENSOR_STATUS + 0x003eU)
#define VL53L9_REGADDR_LDD_STATUS(N)               (VL53L9_REGBASE_SENSOR_STATUS + ((N) * 0x1U) + 0x003fU)
#define VL53L9_REGFIELD_FW_ERROR                   BIT(7)
#define VL53L9_REGFIELD_REF_ARRAY_ERROR            BIT(6)
#define VL53L9_REGFIELD_PLL_LOCK_ERROR             BIT(5)
#define VL53L9_REGFIELD_SOF_OUTSIDE_BLANKING_ERROR BIT(4)
#define VL53L9_REGFIELD_I_LIMIT_ERROR              BIT(3)
#define VL53L9_REGFIELD_SPAD_SUPPLY_OVERLOAD_ERROR BIT(2)
#define VL53L9_REGFIELD_VHV_UNDERVOLTAGE_ERROR     BIT(1)
#define VL53L9_REGFIELD_VHV_OVERVOLTAGE_ERROR      BIT(0)

#define VL53L9_REGBASE_FW_STATUS     (0x008cU)
#define VL53L9_REGADDR_SYSTEM_FSM    (VL53L9_REGBASE_FW_STATUS + 0x0000U)
#define VL53L9_REGADDR_COMMAND_ERROR (VL53L9_REGBASE_FW_STATUS + 0x0001U)
#define VL53L9_REGADDR_FRAME_READY   (VL53L9_REGBASE_FW_STATUS + 0x0002U)
#define VL53L9_REGFIELD_FRAME_READY  BIT(0)

#define VL53L9_REGBASE_CONTROL (0x0400U)
#define VL53L9_REGADDR_COMMAND (VL53L9_REGBASE_CONTROL + 0x0000U)

#define VL53L9_REGBASE_BOOT_SETTINGS         (0x042cU)
#define VL53L9_REGADDR_EXT_CLOCK             (VL53L9_REGBASE_BOOT_SETTINGS + 0x0000U)
#define VL53L9_REGADDR_SETTING_INSTALL_PATCH (VL53L9_REGBASE_BOOT_SETTINGS + 0x0004U)
#define VL53L9_REGADDR_VDDA_CFG              (VL53L9_REGBASE_BOOT_SETTINGS + 0x000cU)
#define VL53L9_REGADDR_VDDIO_CFG             (VL53L9_REGBASE_BOOT_SETTINGS + 0x000dU)

#define VL53L9_REGBASE_STANDBY_SETTINGS      (0x0460U)
#define VL53L9_REGADDR_CSI2_DATA_RATE        (VL53L9_REGBASE_STANDBY_SETTINGS + 0x0000U)
#define VL53L9_REGADDR_CSI2_VIRTUAL_CHANNEL  (VL53L9_REGBASE_STANDBY_SETTINGS + 0x0004U)
#define VL53L9_REGFIELD_CSI2_VIRTUAL_CHANNEL BIT(0)
#define VL53L9_REGADDR_CSI2_ISL              (VL53L9_REGBASE_STANDBY_SETTINGS + 0x0005U)
#define VL53L9_REGFIELD_CSI2_ISL_FORCE_WIDTH BIT(6)
#define VL53L9_REGFIELD_CSI2_ISL_DATA_TYPE   GENMASK(5, 0)
#define VL53L9_REGADDR_CSI2_FRAME_DATA_TYPE  (VL53L9_REGBASE_STANDBY_SETTINGS + 0x0006U)
#define VL53L9_REGFIELD_CSI2_FRAME_DATA_TYPE GENMASK(5, 0)
#define VL53L9_REGADDR_RANGING_FREQ          (VL53L9_REGBASE_STANDBY_SETTINGS + 0x000cU)
#define VL53L9_REGADDR_CONTEXT_SELECTION     (VL53L9_REGBASE_STANDBY_SETTINGS + 0x001aU)
#define VL53L9_REGFIELD_CONTEXT_SELECTION    GENMASK(1, 0)
#define VL53L9_REGADDR_MODE                  (VL53L9_REGBASE_STANDBY_SETTINGS + 0x001bU)
#define VL53L9_REGADDR_SYNCHRO               (VL53L9_REGBASE_STANDBY_SETTINGS + 0x001cU)
#define VL53L9_REGFIELD_SYNCHRO              GENMASK(1, 0)
#define VL53L9_REGADDR_FORMAT                (VL53L9_REGBASE_STANDBY_SETTINGS + 0x001dU)
#define VL53L9_REGADDR_FRAME_PERIOD          (VL53L9_REGBASE_STANDBY_SETTINGS + 0x0020U)
#define VL53L9_REGADDR_OUTPUT_IF             (VL53L9_REGBASE_STANDBY_SETTINGS + 0x0024U)
#define VL53L9_REGFIELD_OUTPUT_IF            BIT(0)
#define VL53L9_REGADDR_CSI2_FRAME_WIDTH      (VL53L9_REGBASE_STANDBY_SETTINGS + 0x0026U)
#define VL53L9_REGADDR_CSI2_FRAME_HEIGHT     (VL53L9_REGBASE_STANDBY_SETTINGS + 0x0028U)
#define VL53L9_REGADDR_FRAME_SIGNALING_MODE  (VL53L9_REGBASE_STANDBY_SETTINGS + 0x002aU)
#define VL53L9_REGFIELD_FRAME_SIGNALING_MODE BIT(0)
#define VL53L9_REGADDR_INTR_OUTPUT_MODE      (VL53L9_REGBASE_STANDBY_SETTINGS + 0x002bU)
#define VL53L9_REGFIELD_INTR_OUTPUT_MODE     BIT(0)
#define VL53L9_REGADDR_POWER_MODE            (VL53L9_REGBASE_STANDBY_SETTINGS + 0x002cU)
#define VL53L9_REGFIELD_POWER_MODE           GENMASK(1, 0)
#define VL53L9_REGADDR_CAL_REF_OFFSET        (VL53L9_REGBASE_STANDBY_SETTINGS + 0x0036U)
#define VL53L9_REGADDR_CAL_RTN_OFFSET        (VL53L9_REGBASE_STANDBY_SETTINGS + 0x0037U)
#define VL53L9_REGADDR_CAL_PROG_OFFSET_1TO5  (VL53L9_REGBASE_STANDBY_SETTINGS + 0x0038U)
#define VL53L9_REGADDR_CAL_PROG_OFFSET_6     (VL53L9_REGBASE_STANDBY_SETTINGS + 0x003aU)
#define VL53L9_REGADDR_CAL_TARGET_LD         (VL53L9_REGBASE_STANDBY_SETTINGS + 0x003cU)
#define VL53L9_REGADDR_CROP_PARAMS           (VL53L9_REGBASE_STANDBY_SETTINGS + 0x0044U)
#define VL53L9_REGFIELD_CROP_ENABLE          BIT(24)
#define VL53L9_REGFIELD_CROP_Y_OFFSET        GENMASK(23, 18)
#define VL53L9_REGFIELD_CROP_X_OFFSET        GENMASK(17, 12)
#define VL53L9_REGFIELD_CROP_Y_SIZE          GENMASK(11, 6)
#define VL53L9_REGFIELD_CROP_X_SIZE          GENMASK(5, 0)

#define VL53L9_STANDBY_CONTEXT_OFFSET(C) (uint16_t)((C) * 0x04U)
#define VL53L9_STREAM_CONTEXT_OFFSET(C)  (uint16_t)((C) * 0x80U)

#define VL53L9_REGBASE_STANDBY_CONTEXT(C)  (VL53L9_STANDBY_CONTEXT_OFFSET(C) + 0x04c4U)
#define VL53L9_REGADDR_STANDBY_BINNING(C)  (VL53L9_REGBASE_STANDBY_CONTEXT(C) + 0x0000U)
#define VL53L9_REGADDR_STANDBY_DSS_MODE(C) (VL53L9_REGBASE_STANDBY_CONTEXT(C) + 0x0001U)
#define VL53L9_REGADDR_STANDBY_REPEAT(C)   (VL53L9_REGBASE_STANDBY_CONTEXT(C) + 0x0002U)

#define VL53L9_REGBASE_STREAM_CONTEXT(C)               (VL53L9_STREAM_CONTEXT_OFFSET(C) + 0x04ccU)
#define VL53L9_REGADDR_STREAM_STEP_NUMBER(C)           (VL53L9_REGBASE_STREAM_CONTEXT(C) + 0x0000U)
#define VL53L9_REGADDR_STREAM_VCSEL_CH0_STEP(N, C)     (VL53L9_REGBASE_STREAM_CONTEXT(C) + ((N) * 0x1U) + 0x0001U)
#define VL53L9_REGADDR_STREAM_VCSEL_CH1_STEP(N, C)     (VL53L9_REGBASE_STREAM_CONTEXT(C) + ((N) * 0x1U) + 0x0009U)
#define VL53L9_REGADDR_STREAM_BLANKING_STEP(N, C)      (VL53L9_REGBASE_STREAM_CONTEXT(C) + ((N) * 0x2U) + 0x0012U)
#define VL53L9_REGADDR_STREAM_MAX_DITHERING_STEP(N, C) (VL53L9_REGBASE_STREAM_CONTEXT(C) + ((N) * 0x1U) + 0x0022U)
#define VL53L9_REGADDR_STREAM_PULSE_WIDTH_SHORT(C)     (VL53L9_REGBASE_STREAM_CONTEXT(C) + 0x002aU)
#define VL53L9_REGADDR_STREAM_PULSE_WIDTH_LONG(C)      (VL53L9_REGBASE_STREAM_CONTEXT(C) + 0x002bU)
#define VL53L9_REGADDR_STREAM_REF_LONG_OFFSET(C)       (VL53L9_REGBASE_STREAM_CONTEXT(C) + 0x002cU)
#define VL53L9_REGADDR_STREAM_RTN_LONG_OFFSET(C)       (VL53L9_REGBASE_STREAM_CONTEXT(C) + 0x002dU)
#define VL53L9_REGADDR_STREAM_RTN_SHORT_OFFSET(C)      (VL53L9_REGBASE_STREAM_CONTEXT(C) + 0x002eU)
#define VL53L9_REGADDR_STREAM_SWITCHOVER_DIST(C)       (VL53L9_REGBASE_STREAM_CONTEXT(C) + 0x0030U)
#define VL53L9_REGADDR_STREAM_NB_SHOT_STEP(N, C)       (VL53L9_REGBASE_STREAM_CONTEXT(C) + ((N) * 0x4U) + 0x0034U)

#define VL53L9_REGBASE_DEBUG_SETTINGS           (0x05ccU)
#define VL53L9_REGADDR_DSS_DEFAULT_INIT_LUT     (VL53L9_REGBASE_DEBUG_SETTINGS + 0x000A)
#define VL53L9_REGADDR_DSS_SHORT_OR_TREE_LIMIT  (VL53L9_REGBASE_DEBUG_SETTINGS + 0x000cU)
#define VL53L9_REGADDR_DSS_SHORT_RATE_SWITCH_LO (VL53L9_REGBASE_DEBUG_SETTINGS + 0x0010U)
#define VL53L9_REGADDR_DSS_SHORT_RATE_SWITCH_HI (VL53L9_REGBASE_DEBUG_SETTINGS + 0x0014U)
#define VL53L9_REGADDR_DSS_SHORT_AMB_WEIGHT     (VL53L9_REGBASE_DEBUG_SETTINGS + 0x0018U)
#define VL53L9_REGADDR_DSS_SHORT_EFF_SPAD(N)    (VL53L9_REGBASE_DEBUG_SETTINGS + ((N) * 0x2U) + 0x0058U)
#define VL53L9_REGADDR_DSS_LONG_OR_TREE_LIMIT   (VL53L9_REGBASE_DEBUG_SETTINGS + 0x008cU)
#define VL53L9_REGADDR_DSS_LONG_RATE_SWITCH_LO  (VL53L9_REGBASE_DEBUG_SETTINGS + 0x0090U)
#define VL53L9_REGADDR_DSS_LONG_RATE_SWITCH_HI  (VL53L9_REGBASE_DEBUG_SETTINGS + 0x0094U)
#define VL53L9_REGADDR_DSS_LONG_AMB_WEIGHT      (VL53L9_REGBASE_DEBUG_SETTINGS + 0x0098U)
#define VL53L9_REGADDR_DSS_LONG_EFF_SPAD(N)     (VL53L9_REGBASE_DEBUG_SETTINGS + ((N) * 0x2U) + 0x00d8U)

#define VL53L9_REGBASE_OTP_MIRROR   (0x06e8U)
#define VL53L9_REGBASE_OTP_MIRROR_2 (0x0d18U)

#define VL53L9_REGBASE_CUSTOM_OTP_MIRROR (0x0ce8U)
#define VL53L9_REGADDR_I2C_SLAVE_ID      (VL53L9_REGBASE_CUSTOM_OTP_MIRROR + 0x0000U)
#define VL53L9_REGFIELD_I2C_SLAVE_ID     GENMASK(6, 0)

#define VL53L9_REGADDR_FWPATCH      (0x1800U) // READY_TO_BOOT, 32kB
#define VL53L9_REGADDR_FRAME_BUFFER (0x1800U) // STANDBY, 46kB
#define VL53L9_REGADDR_FB_DEPTH     (0x1800U) // STREAMING, 46kB

#define VL53L9_REGBASE_SOC_CRM    (0xd000U)
#define VL53L9_REGADDR_SYS_CK_DIV (VL53L9_REGBASE_SOC_CRM + 0x2aU)

#define VL53L9_REGBASE_SOC_I2C_DEVICEID       (VL53L9_REGBASE_SOC_CRM + 0x208U)
#define VL53L9_REGBASE_SOC_I2C_ID_CHANGE_CTRL (VL53L9_REGBASE_SOC_CRM + 0x20AU)

#define VL53L9_REGBASE_SOC_CABDT                (0xd500U)
#define VL53L9_REGADDR_CAB_ALGO_SCALE           (VL53L9_REGBASE_SOC_CABDT + 0x20U)
#define VL53L9_REGFIELD_CAB_AMBIENT_ATTENUATION GENMASK(27, 24)
#define VL53L9_REGADDR_CAB_DIST_SCALE           (VL53L9_REGBASE_SOC_CABDT + 0x24U)
#define VL53L9_REGFIELD_CAB_SHORT_SCALE         GENMASK(31, 16)
#define VL53L9_REGFIELD_CAB_LONG_SCALE          GENMASK(15, 0)

#ifdef __cplusplus
}
#endif

#endif // VL53L9_REG_H
